(function () {
    window.my_city = {
        '台北市': [ '北投區', '士林區', '大同區', '中山區', '松山區', '內湖區', '南港區', '萬華區', '中正區', '大安區', '信義區', '文山區' ],
        '新北市': [ '中和區', '永和區', '板橋區', '新店區', '新莊區', '土城區', '三重區', '蘆洲區', '五股區', '泰山區', '林口區', '鶯歌區', '三峽區', '樹林區', '八里區', '淡水區', '三芝區', '石門區', '金山區', '萬里區', '汐止區', '平溪區', '瑞芳區', '雙溪區', '貢寮區', '石碇區', '深坑區', '坪林區', '烏來區' ],
        '基隆市': [ '七堵區', '安樂區', '中正區', '暖暖區', '信義區', '仁愛區', '中山區'],
        '宜蘭縣': [ '宜蘭市', '羅東鎮', '蘇澳鎮', '頭城鎮', '三星鄉', '礁溪鄉', '冬山鄉', '員山鄉', '壯圍鄉', '五結鄉', '大同鄉', '南澳鄉' ],
        '新竹市': [ '東　區', '北　區', '香山區' ],
        '新竹縣': [ '竹北市', '竹東鎮', '新埔鎮', '關西鎮', '湖口鄉', '新豐鄉', '寶山鄉', '芎林鄉', '橫山鄉', '北埔鄉', '峨眉鄉', '尖石鄉', '五峰鄉' ],
        '桃園市': [ '桃園區', '中壢區', '平鎮區', '八德區', '楊梅區', '大溪區', '蘆竹區', '龜山區', '龍潭區', '大園區', '觀音區', '新屋區', '復興區' ],
        '苗栗縣': [ '苗栗市', '頭份市', '竹南鎮', '後龍鎮', '苑裡鎮', '卓蘭鎮', '通霄鎮', '造橋鄉', '南庄鄉', '三灣鄉', '三義鄉', '大湖鄉', '公館鄉', '獅潭鄉', '頭屋鄉', '銅鑼鄉', '泰安鄉', '西湖鄉' ],
        '台中市': [ '西屯區', '南屯區', '北屯區', '北　區', '西　區', '中　區', '東　區', '南　區', '沙鹿區', '龍井區', '大肚區', '烏日區', '霧峰區', '大里區', '太平區', '豐原區', '石岡區', '新社區', '東勢區', '和平區', '后里區', '神岡區', '大雅區', '潭子區', '大甲區', '大安區', '外埔區', '清水區', '梧棲區' ],
        '彰化縣': [ '彰化市', '花壇鄉', '芬園鄉', '和美鎮', '鹿港鎮', '伸港鄉', '線西鄉', '福興鄉', '秀水鄉', '二林鎮', '溪湖鎮', '北斗鎮', '芳苑鄉', '埔鹽鄉', '埔心鄉', '大城鄉', '竹塘鄉', '埤頭鄉', '溪州鄉', '員林市', '田中鎮', '大村鄉', '永靖鄉', '社頭鄉', '田尾鄉', '二水鄉' ],
        '南投縣': [ '信義鄉', '南投市', '草屯鎮', '埔里鎮', '竹山鎮', '集集鎮', '名間鄉', '中寮鄉', '國姓鄉', '水里鄉', '魚池鄉', '仁愛鄉', '鹿谷鄉' ],
        '嘉義市': [ '東　區', '西　區' ],
        '嘉義縣': [ '朴子市', '太保市', '布袋鎮', '六腳鄉', '東石鄉', '義竹鄉', '鹿草鄉', '水上鄉', '大林鎮', '溪口鄉', '梅山鄉', '新港鄉', '民雄鄉', '竹崎鄉', '中埔鄉', '番路鄉', '大埔鄉', '阿里山鄉' ],
        '雲林縣': [ '斗六市', '土庫鎮', '虎尾鎮', '麥寮鄉', '台西鄉', '東勢鄉', '褒忠鄉', '四湖鄉', '元長鄉', '口湖鄉', '北港鎮', '西螺鎮', '斗南鎮', '水林鄉', '崙背鄉', '二崙鄉', '莿桐鄉', '林內鄉', '大埤鄉', '古坑鄉' ],
        '台南市': [ '安南區', '北　區', '中西區', '安平區', '南　區', '東　區', '永康區', '仁德區', '歸仁區', '關廟區', '龍崎區', '七股區', '佳里區', '麻豆區', '善化區', '大內區', '玉井區', '楠西區', '西港區', '安定區', '新市區', '山上區', '新化區', '左鎮區', '南化區', '後壁區', '白河區', '北門區', '學甲區', '鹽水區', '新營區', '柳營區', '東山區', '將軍區', '下營區', '六甲區', '官田區' ],
        '高雄市': [ '那瑪夏區', '楠梓區', '左營區', '鼓山區', '鹽埕區', '旗津區', '三民區', '前金區', '新興區', '苓雅區', '前鎮區', '小港區', '鳳山區', '仁武區', '鳥松區', '大寮區', '林園區', '茄萣區', '湖內區', '路竹區', '永安區', '岡山區', '彌陀區', '梓官區', '橋頭區', '桃源區', '甲仙區', '內門區', '杉林區', '六龜區', '阿蓮區', '田寮區', '旗山區', '美濃區', '茂林區', '燕巢區', '大社區', '大樹區' ],
        '澎湖縣': [ '馬公市', '湖西鄉', '西嶼鄉', '白沙鄉', '望安鄉', '七美鄉' ],
        '金門縣': [ '金城鎮', '金沙鎮', '金湖鎮', '金寧鄉', '烈嶼鄉', '烏坵鄉' ],
        '屏東縣': [ '屏東市', '潮州鎮', '東港鎮', '恆春鎮', '枋寮鄉', '內埔鄉', '長治鄉', '萬丹鄉', '九如鄉', '高樹鄉', '佳冬鄉', '竹田鄉', '新園鄉', '麟洛鄉', '里港鄉', '鹽埔鄉', '萬巒鄉', '新埤鄉', '南州鄉', '林邊鄉', '崁頂鄉', '滿州鄉', '枋山鄉', '車城鄉', '三地門鄉', '牡丹鄉', '瑪家鄉', '琉球鄉', '獅子鄉', '春日鄉', '霧台鄉', '泰武鄉', '來義鄉' ],
        '台東縣': [ '台東市', '成功鎮', '關山鎮', '卑南鄉', '東河鄉', '鹿野鄉', '長濱鄉', '太麻里鄉', '池上鄉', '綠島鄉', '延平鄉', '大武鄉', '蘭嶼鄉', '海端鄉', '金峰鄉', '達仁鄉' ],
        '花蓮縣': [ '花蓮市', '鳳林鎮', '玉里鎮', '吉安鄉', '新城鄉', '壽豐鄉', '光復鄉', '秀林鄉', '瑞穗鄉', '富里鄉', '萬榮鄉', '豐濱鄉', '卓溪鄉' ],
        '連江縣': [ '南竿鄉', '北竿鄉', '莒光鄉', '東引鄉' ],
    }
})()



